БухЭксп/Documents/CW_ОтчетЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>CW_ОтчетЭкспедитора</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлавныйБухгалтер_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПеревставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ДоговорыПоГрузоперевозкам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеОтбора</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокЗаполнения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПеревыставления</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорядокПроведенияДокументов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель_основание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокЗначениеОтбора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаВсего</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетНаПредоплату_Значение</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормируютсясчетаФактуры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресЗначенияОтбораПриКопировании</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПодразделениеОрганизации</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДней</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриложениеКДоговору</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ПриложенияКДоговорам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВсегоСумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Всего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Всего_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Грузоперевозка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаЗатрат</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументРасходов</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_РасходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьСчетФактура</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена_1</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДокументыВознаграждения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Документ</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаДокумента</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ДокументыОтчетаЭкспедитора.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ДокументыОтчетаЭкспедитора</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ОтчетЭкспедитора</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ОтчетЭкспедитора</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СвязанныйДокумент</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.CW_ДоходыПоГрузоперевозке</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатьиЗатратНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатьиЗатратНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_СтатьяЗатрат</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_СтатусыДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_СтатусыДокументов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>СтатусДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_СтатусыДокументов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.CW_ВладельцыСтатуса</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_ВидыОперацийДоходыПоГрузоперевозке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ВидыОперацийДоходыПоГрузоперевозке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОказаниеУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтчетАгента</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Documents/CW_ОтчетЭкспедитора/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
Функция ПолучитьСвязанныеДоходыПоГрузопереовзкам(ОтчетЭкспедитора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент,
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен КАК Проведен
	               |ПОМЕСТИТЬ ВТ_Документы
	               |ИЗ
	               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
	               |ГДЕ
	               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
	               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент <> &СвязанныйДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ГДЕ
	               |	ВТ_Документы.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Документы.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_Документы КАК ВТ_Документы
	               |ГДЕ
	               |	НЕ ВТ_Документы.Проведен";
	
	Запрос.УстановитьПараметр("ОтчетЭкспедитора",  ОтчетЭкспедитора);
	Запрос.УстановитьПараметр("СвязанныйДокумент", ОтчетЭкспедитора.СчетНаПредоплату_Значение);
	
	ПакетРезультатовЗапроса = Запрос.ВыполнитьПакет();
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ВсеДокументы"	, ПакетРезультатовЗапроса[1].Выгрузить().ВыгрузитьКолонку("СвязанныйДокумент"));
	СтруктураДанных.Вставить("Проведенные"	, ПакетРезультатовЗапроса[2].Выгрузить().ВыгрузитьКолонку("СвязанныйДокумент"));
	СтруктураДанных.Вставить("НеПроведенные", ПакетРезультатовЗапроса[3].Выгрузить().ВыгрузитьКолонку("СвязанныйДокумент"));
	
	Возврат СтруктураДанных;
	
КонецФункции

Функция ПолучитьДанныеДокумента(ОтчетЭкспедитора) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент КАК СвязанныйДокумент,
	               |	CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Дата КАК ДатаДокумента,
	               |	ВЫБОР
	               |		КОГДА CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ФормируетсяАкт
	               |			ТОГДА CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ДатаАкта
	               |		ИНАЧЕ CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ДатаСчета
	               |	КОНЕЦ КАК МаксДатаПервичногоДокумента,
	               |	ВЫБОР
	               |		КОГДА CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ФормируетсяАкт
	               |			ТОГДА CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ДатаАкта
	               |		ИНАЧЕ CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.ДатаСчета
	               |	КОНЕЦ КАК МинДатаПервичногоДокумента
	               |ПОМЕСТИТЬ ВТ_ДанныеРегистра
	               |ИЗ
	               |	РегистрСведений.CW_ДокументыОтчетаЭкспедитора КАК CW_ДокументыОтчетаЭкспедитора
	               |ГДЕ
	               |	CW_ДокументыОтчетаЭкспедитора.ОтчетЭкспедитора = &ОтчетЭкспедитора
	               |	И CW_ДокументыОтчетаЭкспедитора.СвязанныйДокумент.Проведен
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеРегистра.СвязанныйДокумент КАК СвязанныйДокумент
	               |ИЗ
	               |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеРегистра.СвязанныйДокумент
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДанныеРегистра.ДатаДокумента КАК ДатаДокумента,
	               |	МАКСИМУМ(ВТ_ДанныеРегистра.МаксДатаПервичногоДокумента) КАК МаксДатаПервичногоДокумента,
	               |	МИНИМУМ(ВТ_ДанныеРегистра.МинДатаПервичногоДокумента) КАК МинДатаПервичногоДокумента
	               |ИЗ
	               |	ВТ_ДанныеРегистра КАК ВТ_ДанныеРегистра
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_ДанныеРегистра.ДатаДокумента";
	
	Запрос.УстановитьПараметр("ОтчетЭкспедитора", ОтчетЭкспедитора);
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	
	СтруктураДанных = Новый Структура("ДоходыПоГрузоперевозке,ДатаДок,МаксДатаПервичногоДокумента,МинДатаПервичногоДокумента", Новый массив,ОтчетЭкспедитора.Дата,КонецДня(ОтчетЭкспедитора.Дата),НачалоДня(ОтчетЭкспедитора.Дата));
	
	//массив документов для отбора
	СтруктураДанных.ДоходыПоГрузоперевозке = ПакетРезультатов[1].Выгрузить().ВыгрузитьКолонку("СвязанныйДокумент");
	
	//Даты
	Выборка =  ПакетРезультатов[2].Выбрать();
	
	Если Выборка.Следующий() тогда
		СтруктураДанных.ДатаДок 					= ?(Выборка.ДатаДокумента 				= Неопределено, ОтчетЭкспедитора.Дата			, Выборка.ДатаДокумента);
		СтруктураДанных.МаксДатаПервичногоДокумента = ?(Выборка.МаксДатаПервичногоДокумента	= Неопределено, КонецДня(ОтчетЭкспедитора.Дата) , Выборка.МаксДатаПервичногоДокумента);
		СтруктураДанных.МинДатаПервичногоДокумента 	= ?(Выборка.МинДатаПервичногоДокумента 	= Неопределено, НачалоДня(ОтчетЭкспедитора.Дата), Выборка.МинДатаПервичногоДокумента);
	Конецесли;
	
	Возврат СтруктураДанных;
	
КонецФункции

#Область процедуры_фоновых_заданий

Процедура РазоватьСвязьДокументаНаСервере(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	Для Каждого СвязанныйДокумент из ПараметрыПроцедуры.ВсеДокументы Цикл
		
		ДокументОбъект = СвязанныйДокумент.ПолучитьОбъект();
		ДокументОбъект.УстановитьпометкуУдаления(Истина);
		
		КлючЗаписи = новый Структура("ОтчетЭкспедитора, СвязанныйДокумент", ПараметрыПроцедуры.Ссылка,СвязанныйДокумент);
		УдалитьЗаписьРегистра(КлючЗаписи);
	
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ПараметрыПроцедуры.ВсеДокументы ,АдресРезультата); 

КонецПроцедуры

Процедура ЗаполнитьТабличнуюЧастьУслуги(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	ПереформироватьПеревыставленииЗатрат = CW_Настройки.ПараметрУчетнойПолитики(ПараметрыПроцедуры.Дата, ПараметрыПроцедуры.Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");

	Запрос = Новый Запрос;
	запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПеревыставлениеОстатки.Грузоперевозка КАК Грузоперевозка,
	               |	CW_ПеревыставлениеОстатки.Грузоперевозка.Заказ КАК Заказ,
	               |	CW_ПеревыставлениеОстатки.Номенклатура КАК Номенклатура,
	               |	CW_ПеревыставлениеОстатки.КоличествоОстаток КАК Количество_1,
	               |	CW_ПеревыставлениеОстатки.КоличествоОстаток КАК Количество,
	               |	ВЫБОР
	               |		КОГДА CW_ПеревыставлениеОстатки.КоличествоОстаток <> 0
	               |			ТОГДА CW_ПеревыставлениеОстатки.СуммаОстаток / CW_ПеревыставлениеОстатки.КоличествоОстаток
	               |		ИНАЧЕ CW_ПеревыставлениеОстатки.СуммаОстаток
	               |	КОНЕЦ КАК Цена_1,
	               |	ВЫБОР
	               |		КОГДА CW_ПеревыставлениеОстатки.КоличествоОстаток <> 0
	               |			ТОГДА CW_ПеревыставлениеОстатки.СуммаОстаток / CW_ПеревыставлениеОстатки.КоличествоОстаток
	               |		ИНАЧЕ CW_ПеревыставлениеОстатки.СуммаОстаток
	               |	КОНЕЦ КАК Цена,
	               |	CW_ПеревыставлениеОстатки.СуммаОстаток КАК Сумма_1,
	               |	CW_ПеревыставлениеОстатки.СуммаОстаток КАК Сумма,
	               |	CW_ПеревыставлениеОстатки.НДСОстаток КАК СуммаНДС_1,
	               |	CW_ПеревыставлениеОстатки.НДСОстаток КАК СуммаНДС,
	               |	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК Всего_1,
	               |	CW_ПеревыставлениеОстатки.ВсегоОстаток КАК Всего,
	               |	CW_ПеревыставлениеОстатки.СтавкаНДС КАК СтавкаНДС,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов КАК ДокументРасходов,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов.Контрагент КАК Контрагент,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов.ПредъявленСФ КАК ЕстьСчетФактура,
	               |	CW_ПеревыставлениеОстатки.ДокументРасходов.ДатаАкта КАК ДатаЗатрат,
	               |	CW_ПеревыставлениеОстатки.Контрагент КАК Покупатель,
	               |	CW_ПеревыставлениеОстатки.Договор КАК ДоговорПокупателя,
	               |	ЗНАЧЕНИЕ(Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление) КАК ПорядокОтражения
	               |ИЗ
	               |	РегистрНакопления.CW_Перевыставление.Остатки(
	               |			&ДатаОстатка,
	               |			Контрагент = &Контрагент
				   //Подсистема.УчетПриложенийДоговоров
				   |				И ПриложениеКДоговору = &ПриложениеКДоговору
				   //Подсистема.УчетПриложенийДоговоров
				   |				И Договор = &Договор
				   |				//УсловиеПоОбъектам
				   |				//УсловиеВеденияУчетаПоПодразделениям
				   |				И ДокументРасходов.Корректировка = ЛОЖЬ) КАК CW_ПеревыставлениеОстатки";
				   
	Запрос.УстановитьПараметр("МассивОбъектов"			, ПараметрыПроцедуры.МассивОбъектов);
	Запрос.УстановитьПараметр("ОбъектОстатков"			, ПараметрыПроцедуры.МассивОбъектов[0]);
	Запрос.УстановитьПараметр("ДатаОстатка"				, ПараметрыПроцедуры.Дата);
	Запрос.УстановитьПараметр("Контрагент"				, ПараметрыПроцедуры.Контрагент);
	Запрос.УстановитьПараметр("Договор"					, ПараметрыПроцедуры.Договор);
	
	//Подсистема.УчетПриложенийДоговоров
	Запрос.УстановитьПараметр("ПриложениеКДоговору"		, ПараметрыПроцедуры.ПриложениеКДоговору);
	//Подсистема.УчетПриложенийДоговоров
	
	Запрос.УстановитьПараметр("ВестиУчетПоПодразделениям"	, ПараметрыПроцедуры.ВестиУчетПоПодразделениям);
	Запрос.УстановитьПараметр("ПодразделениеОрганизации"	, ПараметрыПроцедуры.ПодразделениеОрганизации);
	
	Если ПараметрыПроцедуры.ВестиУчетПоПодразделениям Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеВеденияУчетаПоПодразделениям", "И ДокументРасходов.ПодразделениеОрганизации = &ПодразделениеОрганизации");
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ОтборПоГрузоперевозкам Тогда
		Если ПараметрыПроцедуры.МассивОбъектов.Количество() > 1 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПоОбъектам", "И Грузоперевозка В (&МассивОбъектов)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПоОбъектам", "И Грузоперевозка  = &ОбъектОстатков");
		КонецЕсли;
	Иначе
		Если ПараметрыПроцедуры.МассивОбъектов.Количество() > 1 Тогда
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПоОбъектам", "И ДокументРасходов В (&МассивОбъектов)");
		Иначе
			Запрос.Текст = СтрЗаменить(Запрос.Текст,"//УсловиеПоОбъектам", "И ДокументРасходов  = &ОбъектОстатков");
		КонецЕсли;
	КонецЕсли;
	
	ТаблицаЗапроса = Запрос.Выполнить().Выгрузить();     
	
	ТаблицаЗапроса.Колонки.Добавить("Представление", Новый ОписаниеТипов("Строка"));
	
	Документы.CW_ДоходыПоГрузоперевозке.Услуги_СформироватьПредставлениеНоменклатуры(ТаблицаЗапроса, ПараметрыПроцедуры.Договор,ПараметрыПроцедуры.Объект,ПереформироватьПеревыставленииЗатрат);

	ПоместитьВоВременноеХранилище(ТаблицаЗапроса, АдресРезультата);
	
КонецПроцедуры

Процедура СформироватьДокументыОтчетаЭкспедитора(ПараметрыПроцедуры, АдресРезультата) Экспорт
	
	УстанавливатьПризнакНаличияДляНовыхСчетов = Ложь;
	КонтролироватьПолучениеОригиналовОтКлиентов = ПолучитьФункциональнуюОпцию("CW_КонтролироватьПолучениеОригиналовОтКлиентов");
	Если  КонтролироватьПолучениеОригиналовОтКлиентов тогда
		УстанавливатьПризнакНаличияДляНовыхСчетов 	= Константы.CW_УстанавливатьПризнакНаличияОригиналовДляСчетов.Получить();
	КонецЕсли;
	
	ТребуетсяПересчетВалюты 		= ПараметрыПроцедуры.ВалютаДокумента <> ПараметрыПроцедуры.ВалютаРегламентированногоУчета;
	
	ОбъектПараметров = ПараметрыПроцедуры.Договор;
	
	//Подсистема.УчетПриложенийДоговоров
	Если ЗначениеЗаполнено(ПараметрыПроцедуры.ПриложениеКДоговору) Тогда
		ОбъектПараметров = ПараметрыПроцедуры.ПриложениеКДоговору;
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	СтруктураПараметров = CW_Настройки.ПустаяСтруктураПолученияПараметровДоговора();
	СтруктураПараметров.Дата 				= ПараметрыПроцедуры.Дата;
	СтруктураПараметров.Договор 			= ПараметрыПроцедуры.Договор;
	СтруктураПараметров.ПриложениеКДоговору = ПараметрыПроцедуры.ПриложениеКДоговору;
	
	ПараметрыДоговора	= CW_Настройки.ПолучитьПараметрыДоговора(СтруктураПараметров);
	
	ПереформироватьПредставление 	= CW_Настройки.ПараметрУчетнойПолитики(ПараметрыПроцедуры.Дата, ПараметрыПроцедуры.Организация, "ЗановоФормироватьПредставлениеПриПеревыставленииЗатрат");
	ОсновнаяСтатьяЗатрат 			= CW_Настройки.ПараметрУчетнойПолитики(ПараметрыПроцедуры.Дата, ПараметрыПроцедуры.Организация, "ОсновнаяСтатьяЗатрат");
	
	Если ПараметрыПроцедуры.УстановитьСтатусДокумента Тогда
		СтатусДокумента = ПараметрыПроцедуры.СтатусДокумента;
		Если Не ЗначениеЗаполнено(СтатусДокумента) Тогда
			СтатусДокумента = Справочники.CW_СтатусыДокументов.ПолучитьСтатусНовогоОбъекта(Тип("ДокументСсылка.CW_ДоходыПоГрузоперевозке"));
		КонецЕсли;
	КонецЕсли;
	
	Если ПараметрыПроцедуры.ПорядокПеревыставления = 0  Тогда //Сводно 
		ПолеГруппировки		= "ЛОЖЬ";
	ИначеЕсли ПараметрыПроцедуры.ПорядокПеревыставления = 1 Тогда  //Сводно в пределах даты
		ПолеГруппировки 	= "ВнешняяТаблица.ДатаЗатрат";
	ИначеЕсли ПараметрыПроцедуры.ПорядокПеревыставления = 2 Тогда  //По документу поставщика  
		ПолеГруппировки 	= "ВнешняяТаблица.ДокументРасходов";
	ИначеЕсли ПараметрыПроцедуры.ПорядокПеревыставления = 3 Тогда    // Интевалом по несколько дней
		ПолеГруппировки		= "ДАТАВРЕМЯ(1,1,1,0,0,0)";
	КонецЕсли;
	
	СтруктураСвязанныеДокументы = Документы.CW_ОтчетЭкспедитора.ПолучитьСвязанныеДоходыПоГрузопереовзкам(ПараметрыПроцедуры.Ссылка);
	ОтменитьПроведениеВсехСвязанныхДокументов(СтруктураСвязанныеДокументы);
	
	Запрос 		 = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
					|	//ДополнительнаяГруппировка КАК ДополнительнаяГруппировка,
					|	ВнешняяТаблица.Грузоперевозка КАК Грузоперевозка,
					|	ВнешняяТаблица.Номенклатура КАК Номенклатура,
					|	ВнешняяТаблица.Количество КАК Количество,
					|	ВнешняяТаблица.Цена КАК Цена,
					|	ВнешняяТаблица.Сумма КАК Сумма,
					|	ВнешняяТаблица.СтавкаНДС КАК СтавкаНДС,
					|	ВнешняяТаблица.СуммаНДС КАК СуммаНДС,
					|	ВнешняяТаблица.Всего КАК Всего,
					|	ВнешняяТаблица.ЕстьСчетФактура КАК ЕстьСчетФактура,
					|	ВнешняяТаблица.ДокументРасходов КАК ДокументРасходов,
					|	ВнешняяТаблица.Представление КАК Представление,
					|	ВнешняяТаблица.ДатаЗатрат КАК ДатаРасхода,
					|	НАЧАЛОПЕРИОДА(ВнешняяТаблица.ДатаЗатрат, ДЕНЬ) КАК ДатаЗатрат,
					|	ЛОЖЬ КАК Заполнено
					|ПОМЕСТИТЬ ВТ_ДанныеДокумента
					|ИЗ
					|	&ТаблицаУслуг КАК ВнешняяТаблица
					|;
					|
					|////////////////////////////////////////////////////////////////////////////////
					|ВЫБРАТЬ *
					|ИЗ
					|	ВТ_ДанныеДокумента КАК ВТ_ДанныеДокумента";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "//ДополнительнаяГруппировка", ПолеГруппировки);
	
	Запрос.УстановитьПараметр("ТаблицаУслуг", ПараметрыПроцедуры.ТаблицаУслуг);
	
	ПромежуточныйРезульат = Запрос.Выполнить();
	
	УничтожитьВременнуюТаблицу(Запрос, "ВТ_ДанныеДокумента");
	
	Если  ПараметрыПроцедуры.ПорядокПеревыставления = 3 Тогда
		
		ВремТаблица = ПромежуточныйРезульат.Выгрузить();
		ВремТаблица.Сортировать("ДатаЗатрат ВОЗР");
		
		ОбработатьТаблицуРезультата(ВремТаблица,ПараметрыПроцедуры.КоличествоДней);
		
		ВнешниеДанные = ВремТаблица;
		
	Иначе
		ВнешниеДанные = ПромежуточныйРезульат.Выгрузить();
	КонецЕсли;
	
	Запрос 		 = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	Запрос.Текст = 	"ВЫБРАТЬ *
					|ПОМЕСТИТЬ ВТ_ВнешниеДанные
					|ИЗ
					|	&ВнешниеДанные КАК ВнешниеДанные";
	
	Запрос.УстановитьПараметр("ВнешниеДанные", ВнешниеДанные);
	Запрос.Выполнить();

	Запрос.Текст = "ВЫБРАТЬ
	               |	ВТ_ВнешниеДанные.Грузоперевозка КАК Грузоперевозка,
	               |	ВТ_ВнешниеДанные.Номенклатура КАК Номенклатура,
	               |	ВТ_ВнешниеДанные.Количество КАК Количество,
	               |	ВТ_ВнешниеДанные.Цена КАК Цена_Рег,
	               |	ВТ_ВнешниеДанные.Сумма КАК Сумма_Рег,
	               |	ВТ_ВнешниеДанные.СтавкаНДС КАК СтавкаНДС,
	               |	ВТ_ВнешниеДанные.СуммаНДС КАК НДС_Рег,
	               |	ВТ_ВнешниеДанные.Всего КАК Всего_Рег,
	               |	ВТ_ВнешниеДанные.ДополнительнаяГруппировка КАК ДополнительнаяГруппировка,
	               |	ВТ_ВнешниеДанные.ЕстьСчетФактура КАК ЕстьСчетФактура,
	               |	ЕСТЬNULL(CW_СтатьиЗатратНоменклатуры.СтатьяЗатрат, НЕОПРЕДЕЛЕНО) КАК СтатьяЗатрат,
	               |	ВТ_ВнешниеДанные.ДокументРасходов КАК ДокументРасходов,
	               |	ВТ_ВнешниеДанные.Представление КАК Представление
	               |ИЗ
	               |	ВТ_ВнешниеДанные КАК ВТ_ВнешниеДанные
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_СтатьиЗатратНоменклатуры КАК CW_СтатьиЗатратНоменклатуры
	               |		ПО ВТ_ВнешниеДанные.Номенклатура = CW_СтатьиЗатратНоменклатуры.Номенклатура
	               |ИТОГИ ПО
	               |	ЕстьСчетФактура,
	               |	ДополнительнаяГруппировка";
	
	
	РезультатЗапроса = Запрос.Выполнить();
	
	УничтожитьВременнуюТаблицу(Запрос, "ВТ_ВнешниеДанные");

	Выборка_ЕстьСчетФактура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	МассивДокументов = Новый Массив;
	Пока Выборка_ЕстьСчетФактура.Следующий() Цикл
		
		Выборка_Дополнительно = Выборка_ЕстьСчетФактура.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		
		Пока Выборка_Дополнительно.Следующий() Цикл
			
			Если СтруктураСвязанныеДокументы.ВсеДокументы.Количество() = 0 Тогда
				НовыйДокумент = Документы.CW_ДоходыПоГрузоперевозке.СоздатьДокумент();
			Иначе
				НовыйДокумент = СтруктураСвязанныеДокументы.ВсеДокументы[0].ПолучитьОбъект();
				
				Если НовыйДокумент.ПометкаУдаления Тогда
					НовыйДокумент.ПометкаУдаления = Ложь;
				КонецЕсли;
				
				НовыйДокумент.Услуги.Очистить();
				
				СтруктураСвязанныеДокументы.ВсеДокументы.Удалить(0);
			КонецЕсли;
			
			ЗаполнитьШапкуДокумента(НовыйДокумент, ПараметрыПроцедуры);
			
			НовыйДокумент.ДатаСчета 		= "";
			НовыйДокумент.ДатаАкта  		= "";
			НовыйДокумент.ДатаСчетаФактуры 	= "";
			
			НовыйДокумент.ФормируетсяАкт 	= Истина;
			
			Если ЗначениеЗаполнено(ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ) Тогда
				НовыйДокумент.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ = ПараметрыДоговора.ПорядокЗаполненияРасчётноПлатёжныхДокументовСФ;
			КонецЕсли;
			
			
			НовыйДокумент.КодСпособаВыставления  = ПараметрыДоговора.ОсновнойКодСпособаВыставленияСчетовФактур;
			
			//ПорядокПеревыставления: 	Сводно(0), Сводно в пределах даты(1), По документу поставщика(2), Группировать документы по..(3)
			//ДатаПеревставления: 		Дата отчета(0), Дата поставщика(1)
			Если ПараметрыПроцедуры.ПорядокПеревыставления = 0 Тогда
				ДатаДокумента 		= ПараметрыПроцедуры.Дата;
			ИначеЕсли ПараметрыПроцедуры.ПорядокПеревыставления = 1 Тогда
				Если ПараметрыПроцедуры.ДатаПеревставления = 1 Тогда
					ДатаДокумента = Выборка_Дополнительно.ДополнительнаяГруппировка;
				Иначе
					ДатаДокумента = ПараметрыПроцедуры.Дата;
				КонецЕсли;
			ИначеЕсли ПараметрыПроцедуры.ПорядокПеревыставления = 2 Тогда
				Если ПараметрыПроцедуры.ДатаПеревставления = 1 Тогда
					ДатаДокумента = Выборка_Дополнительно.ДополнительнаяГруппировка.Дата;
				Иначе
					ДатаДокумента = ПараметрыПроцедуры.Дата;
				КонецЕсли;
			ИначеЕсли  ПараметрыПроцедуры.ПорядокПеревыставления = 3 Тогда
				ДатаДокумента = Выборка_Дополнительно.ДополнительнаяГруппировка;
			КонецЕсли;
			
			НоваяДата = ДатаДокумента + 1;
			Если День(НоваяДата) <> День(ДатаДокумента) Тогда
				//вышли за пределы дня
				НоваяДата =	ДатаДокумента;
			Конецесли;
			
			НовыйДокумент.Дата = НоваяДата;
							
			Если ЗначениеЗаполнено(ПараметрыДоговора.ПорядокЗачетаАвансовОЗ) Тогда
				НовыйДокумент.СпособЗачетаАвансовОЗ = ПараметрыДоговора.ПорядокЗачетаАвансовОЗ;
			КонецЕсли;
			Если ЗначениеЗаполнено(ПараметрыДоговора.ПорядокЗачетаАвансов) Тогда
				НовыйДокумент.СпособЗачетаАвансов = ПараметрыДоговора.ПорядокЗачетаАвансов;
			КонецЕсли;
			
			Если НЕ ПараметрыПроцедуры.БухгалтерскийУчет Тогда
				НовыйДокумент.СпособЗачетаАвансов = ПредопределенноеЗначение("Перечисление.СпособыЗачетаАвансов.НеЗачитывать");
			КонецЕсли;
			
			//К ранее выставленному(0), Новый счет(1), Без счета(2)
			НовыйДокумент.ФормируетсяСчет = ПараметрыПроцедуры.СчетНаПредоплату = 1;
			Если ПараметрыПроцедуры.СчетНаПредоплату = 0 тогда
				НовыйДокумент.Счет = ПараметрыПроцедуры.СчетНаПредоплату_Значение;
			КонецЕсли;
			
			НовыйДокумент.ФормируетсяСчетФактура = Выборка_Дополнительно.ЕстьСчетФактура;
			
			Если Выборка_Дополнительно.ЕстьСчетФактура Тогда
				НовыйДокумент.ДатаСчетаФактуры 	= НовыйДокумент.Дата;
			КонецЕсли; 
			
			НовыйДокумент.ЭтоУниверсальныйДокумент = ПараметрыДоговора.ИспользуетсяУниверсальныйДокумент;
			
			НовыйДокумент.Комментарий = ПараметрыПроцедуры.Комментарий;
			
			СтруктураКурса = CW_Финансы.ПолучитьКурсВалюты(НовыйДокумент.Валюта,?(НовыйДокумент.ДатаАкта=Дата(1,1,1),НовыйДокумент.Дата,НовыйДокумент.ДатаАкта));
			
			Выборка_Детали = Выборка_Дополнительно.Выбрать();
			
			//вынужденное формирование таблицы значений, 
			//так как в последующих процедурах используется
			//именно такая таблица значений
			ТаблицаУслуг = НовыйДокумент.Услуги.Выгрузить();
			ТаблицаУслуг.Колонки.Добавить("Всего_Рег");
			ТаблицаУслуг.Колонки.Добавить("НДС_Рег");
			ТаблицаУслуг.Колонки.Добавить("Сумма_Рег");
			ТаблицаУслуг.Колонки.Добавить("Цена_Рег");
			
			Пока Выборка_Детали.Следующий() Цикл
				//Заполнение табличной части документа
				НоваяСтрока = ТаблицаУслуг.Добавить();
				
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка_Детали);
				
				Если не ЗначениеЗаполнено(НоваяСтрока.СтатьяЗатрат) Тогда
					НоваяСтрока.СтатьяЗатрат = ОсновнаяСтатьяЗатрат;
				Конецесли;
				
				Если не ЗначениеЗаполнено(НоваяСтрока.СтавкаНДС) Тогда
					НоваяСтрока.СтатьяЗатрат =  CW_БухгалтерияЭкспедитораСерверПереопределяемый.СтавкаНДС(НоваяСтрока.Номенклатура, ПараметрыПроцедуры.Дата);
				Конецесли;
				
				НоваяСтрока.ПорядокОтражения = ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление");
				
				Если ТребуетсяПересчетВалюты Тогда
					ПересчитатьПоКурсу(НоваяСтрока, Выборка_Детали, СтруктураКурса);
				Иначе
					НоваяСтрока.Всего 	= Выборка_Детали.Всего_Рег;
					НоваяСтрока.НДС 	= Выборка_Детали.НДС_Рег;
					НоваяСтрока.Сумма 	= Выборка_Детали.Сумма_Рег;
					НоваяСтрока.Цена 	= Выборка_Детали.Цена_Рег;
				КонецЕсли
				
			КонецЦикла;
			
			НовыйДокумент.Услуги.Загрузить(ТаблицаУслуг);
			НовыйДокумент.Записать(РежимЗаписиДокумента.Запись);
			
			Если ПараметрыПроцедуры.ПорядокПроведенияДокументов = 1 Тогда
				НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
			КонецЕсли;
			
			//Подсистема.СтатусыДокументов
			Если ПараметрыПроцедуры.УстановитьСтатусДокумента Тогда
				
				ДанныеДляЗаписи = Новый Структура;
				ДанныеДляЗаписи.Вставить("Документ", 		НовыйДокумент.Ссылка);
				ДанныеДляЗаписи.Вставить("СтатусДокумента", СтатусДокумента);
				ДанныеДляЗаписи.Вставить("Комментарий", 	"");
				ДанныеДляЗаписи.Вставить("Автор", 			ПараметрыСеанса.ТекущийПользователь);
				
				РегистрыСведений.CW_СтатусыДокументов.ДобавитьЗаписьВРегистр(ДанныеДляЗаписи);
			КонецЕсли;
			
			//Подсистема.СтатусыДокументов
			
			МассивДокументов.Добавить(НовыйДокумент.Ссылка);
			
			УстановитьПризнакНаличияИдатуВозвратаОригиналов(НовыйДокумент, УстанавливатьПризнакНаличияДляНовыхСчетов);
			
			//Фиксируем документ в регистре
			КлючЗаписи = Новый Структура("ОтчетЭкспедитора,СвязанныйДокумент",ПараметрыПроцедуры.Ссылка,НовыйДокумент.Ссылка);
			ЗаписатьДокументВРегистр(КлючЗаписи);
			
		КонецЦикла;
		
	КонецЦикла;
	
	Если СтруктураСвязанныеДокументы.ВсеДокументы.Количество() > 0 Тогда
		//нужно открепить существующие документы
		ПометитьНаУдалениеВсеСвязанныеДокументы(СтруктураСвязанныеДокументы);
		Для Каждого СвязанныйДокумент из СтруктураСвязанныеДокументы.ВсеДокументы Цикл
			КлючЗаписи = новый Структура("ОтчетЭкспедитора, СвязанныйДокумент", ПараметрыПроцедуры.Ссылка,СвязанныйДокумент);
			УдалитьЗаписьРегистра(КлючЗаписи);
		КонецЦикла;
	КонецЕсли;
	
	ПоместитьВоВременноеХранилище(МассивДокументов,АдресРезультата);
	
КонецПроцедуры

Процедура УстановитьПризнакНаличияИдатуВозвратаОригиналов(Знач НовыйДокумент, Знач УстанавливатьПризнакНаличияДляНовыхСчетов)
	
	Перем ДанныеДлязаписи, ДатаВозврата, ОригиналыПредоставлены, СтруктураПараметров;
	
	ДатаВозврата 			= Дата(1,1,1);  
	ОригиналыПредоставлены 	= Ложь;
	Если УстанавливатьПризнакНаличияДляНовыхСчетов и  НовыйДокумент.ФормируетсяСчет и НЕ НовыйДокумент.ФормируетсяАкт Тогда
		ОригиналыПредоставлены 	= истина;
		ДатаВозврата 			= ?(ЗначениеЗаполнено(НовыйДокумент.ДатаСчета), НовыйДокумент.ДатаСчета, ТекущаяДата());
		Если Не ЗначениеЗаполнено(ДатаВозврата) Тогда
			ДатаВозврата =  ТекущаяДата();  
		Конецесли
	КонецЕсли;
	
	ДанныеДлязаписи = Новый Структура;
	ДанныеДлязаписи.Вставить("ЗаписьНового"			, Ложь);
	ДанныеДлязаписи.Вставить("Ссылка"				, НовыйДокумент.Ссылка);
	ДанныеДлязаписи.Вставить("Признак"				, ОригиналыПредоставлены);
	ДанныеДлязаписи.Вставить("ДатаВозврата" 		, ДатаВозврата);
	
	СтруктураПараметров = CW_Документы.ПодготовитьСтруктуруДляЗаписиналичияОригиналовДокументов(ДанныеДлязаписи);
	
	CW_Документы.УстановитьПризнакНаличияИдатуВозвратаОригиналов(СтруктураПараметров);

КонецПроцедуры

Процедура УничтожитьВременнуюТаблицу(Знач Запрос, ЗНАЧ ИмяТаблицы)
	
	Запрос.Текст = "УНИЧТОЖИТЬ "+ИмяТаблицы;
	Запрос.Выполнить();

КонецПроцедуры  

Процедура ОтменитьПроведениеВсехСвязанныхДокументов(ПараметрыПроцедуры) Экспорт
	
	Для Каждого СвязанныйДокумент из ПараметрыПроцедуры.ВсеДокументы Цикл
		//Обрабатываем документ
		ДокументОбъект = СвязанныйДокумент.ПолучитьОбъект();
		Если ДокументОбъект.ПометкаУдаления Тогда
			Продолжить;
		КонецЕсли;
		ДокументОбъект.Записать(РежимЗаписиДокумента.ОтменаПроведения);
	КонецЦикла;
	
КонецПроцедуры

Процедура ПометитьНаУдалениеВсеСвязанныеДокументы(ПараметрыПроцедуры) Экспорт
	
	Для Каждого СвязанныйДокумент из ПараметрыПроцедуры.ВсеДокументы Цикл
		//Обрабатываем документ
		ДокументОбъект = СвязанныйДокумент.ПолучитьОбъект();
		ДокументОбъект.УстановитьпометкуУдаления(Истина);
	КонецЦикла;
	
КонецПроцедуры

//Подсистема.СтатусыДокументов
Процедура УстановитьСтатусСвязанныхДокументов(ПараметрыПроцедуры, АдресРезультата=Неопределено) Экспорт
	
	ДанныеДляЗаписи = Новый Структура;
	ДанныеДляЗаписи.Вставить("Документ", 		Неопределено);
	ДанныеДляЗаписи.Вставить("СтатусДокумента", ПараметрыПроцедуры.УстанавливаемыйСтатус);
	ДанныеДляЗаписи.Вставить("Комментарий", 	"");
	ДанныеДляЗаписи.Вставить("Автор", 			ПараметрыСеанса.ТекущийПользователь);
	
	Для Каждого СвязанныйДокумент из ПараметрыПроцедуры.ВсеДокументы Цикл
		
		ДанныеДляЗаписи.Вставить("Документ", СвязанныйДокумент);
		РегистрыСведений.CW_СтатусыДокументов.ДобавитьЗаписьВРегистр(ДанныеДляЗаписи);
		
	КонецЦикла;
	
	ПоместитьВоВременноеХранилище(ПараметрыПроцедуры.ВсеДокументы ,АдресРезультата); 
	
КонецПроцедуры
//Подсистема.СтатусыДокументов

#КонецОбласти

Процедура ЗаписатьДокументВРегистр(КлючЗаписи) Экспорт 
	
	НоваяЗапись = РегистрыСведений.CW_ДокументыОтчетаЭкспедитора.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(НоваяЗапись, КлючЗаписи);
	НоваяЗапись.Записать(истина);
	
КонецПроцедуры

Процедура УдалитьЗаписьРегистра(КлючЗаписи) Экспорт
	
	//Удаляем запись регистра
	ЗаписьРегистра  = РегистрыСведений.CW_ДокументыОтчетаЭкспедитора.СоздатьМенеджерЗаписи();
	ЗаполнитьЗначенияСвойств(ЗаписьРегистра, КлючЗаписи);
	ЗаписьРегистра.Прочитать();
	
	Если ЗаписьРегистра.Выбран() Тогда
		ЗаписьРегистра.Удалить();
	КонецЕсли;
	
КонецПроцедуры

Процедура ЗаполнитьШапкуДокумента(НовыйДокумент, ДанныеШапки)
	
	НовыйДокумент.Организация 					= ДанныеШапки.Организация;
	НовыйДокумент.Ответственный					= ДанныеШапки.Ответственный;
	НовыйДокумент.Руководитель					= ДанныеШапки.Руководитель;
	НовыйДокумент.ЗаРуководителяПоПриказу		= ДанныеШапки.Руководитель_основание;
	НовыйДокумент.ГлавныйБухгалтер				= ДанныеШапки.ГлавныйБухгалтер;
	НовыйДокумент.ЗаГлавногоБухгалтераПоПриказу	= ДанныеШапки.ГлавныйБухгалтер_основание;
	
	НовыйДокумент.ВидОперации 	= ПредопределенноеЗначение("Перечисление.CW_ВидыОперацийДоходыПоГрузоперевозке.ОказаниеУслуг");
	НовыйДокумент.Контрагент 	= ДанныеШапки.Контрагент;
	НовыйДокумент.Договор 		= ДанныеШапки.Договор;
	
	//Подсистема.УчетПриложенийДоговоров
	НовыйДокумент.ПриложениеКДоговору = ДанныеШапки.ПриложениеКДоговору;
	//Подсистема.УчетПриложенийДоговоров
	
	НовыйДокумент.Валюта 		= ДанныеШапки.ВалютаДокумента;  
	
	//Для версии КОРП
	Если ДанныеШапки.ВестиУчетПоПодразделениям Тогда
		НовыйДокумент.ПодразделениеОрганизации = ДанныеШапки.ПодразделениеОрганизации;	
	КонецЕсли;
	//Для версии КОРП

	ЗаполнитьПодписантов(НовыйДокумент, ДанныеШапки);
	
КонецПроцедуры  

Процедура ЗаполнитьПодписантов(НовыйДокумент, Параметры)
	
	Если Не Параметры.ЗаполнятьПодписантов 
		или Не ЗначениеЗаполнено(Параметры.Организация) Тогда
		Возврат;
	КонецЕсли;
	
	//Очистить реквизиты
	НовыйДокумент.Руководитель 					= Неопределено;
	НовыйДокумент.ЗаРуководителяПоПриказу 		= "";
	НовыйДокумент.ГлавныйБухгалтер 				= Неопределено;
	НовыйДокумент.ЗаГлавногоБухгалтераПоПриказу = "";
	
	ДанныеПодписантовОрагнизации = _УФС.ПолучитьОтветственныхЛиц(Параметры.Организация, Параметры.ПодразделениеОрганизации);
	
	ДанныеРуководитель = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.Руководитель);
	Если ДанныеРуководитель <> Неопределено Тогда
		ДанныеРуководитель.Свойство("УполномоченноеЛицо", НовыйДокумент.Руководитель);
		ДанныеРуководитель.Свойство("НомерДатаПриказа"	, НовыйДокумент.ЗаРуководителяПоПриказу);
	КонецЕсли;
	
	ДанныеГлавныйБухгалтер = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.ГлавныйБухгалтер);
	Если ДанныеГлавныйБухгалтер <> Неопределено Тогда
		ДанныеГлавныйБухгалтер.Свойство("УполномоченноеЛицо", НовыйДокумент.ГлавныйБухгалтер);
		ДанныеГлавныйБухгалтер.Свойство("НомерДатаПриказа"	, НовыйДокумент.ЗаГлавногоБухгалтераПоПриказу);
	КонецЕсли;
	
	ДанныеОтветственныйЗаОформление = ДанныеПодписантовОрагнизации.Получить(Перечисления.ОтветственныеЛицаОрганизаций.ОтветственныйЗаОформление);
	Если ДанныеОтветственныйЗаОформление <> Неопределено
		И ДанныеГлавныйБухгалтер <> Неопределено Тогда
		ДанныеГлавныйБухгалтер.Свойство("УполномоченноеЛицо", НовыйДокумент.ОтветственныйЗаОформление);
		ДанныеГлавныйБухгалтер.Свойство("НомерДатаПриказа"	, НовыйДокумент.ОтветственныйЗаОформлениеПоПриказу);
	КонецЕсли;
	
КонецПроцедуры
 

Функция ПолучитьГраницупериода(ИсходнаяДата, КоличествоДней)
	
	Запрос = Новый ЗАпрос;
	Запрос.Текст = 	"ВЫБРАТЬ
					|	ДОБАВИТЬКДАТЕ(&ИсходнаяДата, ДЕНЬ, &Количество) КАК ГраницаИнетвала";
	
	Запрос.УстановитьПараметр("ИсходнаяДата", ИсходнаяДата);
	Запрос.УстановитьПараметр("Количество"  , КоличествоДней);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.ГраницаИнетвала-1;
	
КонецФункции

Процедура ОбработатьТаблицуРезультата(ВремТаблица, КоличествоДней)
	
	ОтборСтрок = Новый Структура("Заполнено", Ложь);
	ИсходныйМассивСтрок = ВремТаблица.НайтиСтроки(ОтборСтрок);
	
	Если ИсходныйМассивСтрок.Количество() > 0 Тогда
		
		ИсходнаяДата 		= ИсходныйМассивСтрок[0].ДатаЗатрат;
		ГраницаИнтервала    = ПолучитьГраницупериода(ИсходнаяДата, КоличествоДней);
		
		МассивСтрокГруппы 	= Новый Массив;
		ПоследняяДата 		= Дата(1,1,1,0,0,0);
		
		Для Каждого СтрокаМассива из ИсходныйМассивСтрок Цикл
			Если СтрокаМассива.ДатаРасхода <= ГраницаИнтервала Тогда
				МассивСтрокГруппы.Добавить(СтрокаМассива);
				ПоследняяДата =  Макс(ПоследняяДата,СтрокаМассива.ДатаРасхода);
			Иначе
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПоследняяДата <> Дата(1,1,1,0,0,0) Тогда
			Для Каждого СтрокаМассива из МассивСтрокГруппы Цикл
				СтрокаМассива.ДополнительнаяГруппировка 	= ПоследняяДата;
				СтрокаМассива.Заполнено 					= Истина;	
			КонецЦикла;	
		КонецЕсли;
		
		ОбработатьТаблицуРезультата(ВремТаблица, КоличествоДней);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПересчитатьПоКурсу(СтрокаДокумента, Детали, СтруктураКурса)
	
	СтрокаДокумента.Всего 	= Окр(_сф.БезопасноРазделить(Окр(Детали.Всего_Рег,2) 	* СтруктураКурса.Кратность,СтруктураКурса.Курс),2);
	СтрокаДокумента.НДС 	= Окр(_сф.БезопасноРазделить(Окр(Детали.НДС_Рег,2) 		* СтруктураКурса.Кратность,СтруктураКурса.Курс),2);
	СтрокаДокумента.Сумма 	= Окр(СтрокаДокумента.Всего - СтрокаДокумента.НДС,2);
	СтрокаДокумента.Цена 	= Окр(_сф.БезопасноРазделить(СтрокаДокумента.Сумма,СтрокаДокумента.Количество),2);
	
КонецПроцедуры

//Шаблоны стандартных писем
Процедура ДополнитьМакросыОбъекта(ДеревоМакросов) Экспорт
	
	ГруппаМакросов = ДеревоМакросов.Строки.Добавить();  
	ГруппаМакросов.ИндексКартинки 	= 0;
	ГруппаМакросов.Значение 		= "";
	ГруппаМакросов.Представление 	= "Отчет экспедитора";
	ГруппаМакросов.ЭтоГруппа 		= Истина;

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[НомерОтчетаЭкспедитора]",	"Номер",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[ДатаОтчетаЭкспедитора]",	"Дата",		2);
	
	ГруппаМакросовОрганизация = ГруппаМакросов.Строки.Добавить();  
	ГруппаМакросовОрганизация.ИндексКартинки 	= 0;
	ГруппаМакросовОрганизация.Значение 		= "";
	ГруппаМакросовОрганизация.Представление 	= "Организация";
	ГруппаМакросовОрганизация.ЭтоГруппа 		= Истина;

	ДобавитьСтрокуМакросов(ГруппаМакросовОрганизация, "[ОрганизацияСокр]",	"Организация (сокращенное)", 	4);
	ДобавитьСтрокуМакросов(ГруппаМакросовОрганизация, "[ОрганизацияПолн]",	"Организация (полное)",	 		4);

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[Клиент]", "Клиент", 4); 
	
	ГруппаМакросовДоговор = ГруппаМакросов.Строки.Добавить();  
	ГруппаМакросовДоговор.ИндексКартинки 	= 0;
	ГруппаМакросовДоговор.Значение 			= "";
	ГруппаМакросовДоговор.Представление 	= "Договор";
	ГруппаМакросовДоговор.ЭтоГруппа 		= Истина;

	ДобавитьСтрокуМакросов(ГруппаМакросовДоговор, "[НомерДоговора]",	"Номер",	4);
	ДобавитьСтрокуМакросов(ГруппаМакросовДоговор, "[ДатаДоговора]",		"Дата",		2);  

	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокГрузоперевозок]",	"Список грузоперевозок",	9);
	ДобавитьСтрокуМакросов(ГруппаМакросов, "[СписокЗаказов]",			"Список заказов",			9);
	
	ГруппаПараметров = ГруппаМакросов.Строки.Добавить();  
	ГруппаПараметров.ИндексКартинки = 0;
	ГруппаПараметров.Значение 		= "";
	ГруппаПараметров.Представление 	= "Параметры грузоперевозок";
	ГруппаПараметров.ЭтоГруппа 		= Истина;
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ДополнитьМакросыПараметровГрузоперевозок(ГруппаПараметров);

КонецПроцедуры  

Процедура ДобавитьСтрокуМакросов(ГруппаМакросов, Значение, Представление, ИндексКартинки)
	
	СтрокаМакроса = ГруппаМакросов.Строки.Добавить();
	СтрокаМакроса.ИндексКартинки 	= ИндексКартинки;
	СтрокаМакроса.Значение 			= Значение;
	СтрокаМакроса.Представление 	= Представление;
	СтрокаМакроса.ЭтоГруппа 		= Ложь;
	
КонецПроцедуры


Процедура ПолучитьОписаниеМакросов(Результат, СтруктураПараметров=Неопределено) Экспорт
	
	Результат.Вставить("[ОрганизацияСокр]",	"");
	Результат.Вставить("[ОрганизацияПолн]",	"");
	
	Результат.Вставить("[ОрганизацияСокр]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).СокращенноеНаименование");
	Результат.Вставить("[ОрганизацияПолн]",	"Справочники.Организации.НаименованияНаДату(Источник.Организация,Источник.Дата).ПолноеНаименование");
	
	Результат.Вставить("[Клиент]", 					"Источник.Контрагент.НаименованиеПолное");
	Результат.Вставить("[СписокГрузоперевозок]", 	"МенеджерОбъектаШаблона.ПолучитьСписокГрузоперевозок(Источник)");  
	Результат.Вставить("[СписокЗаказов]", 			"МенеджерОбъектаШаблона.ПолучитьСписокЗаказов(Источник)");
	
	Результат.Вставить("[НомерДоговора]",			"Источник.Договор.НомерДоговора");
	Результат.Вставить("[ДатаДоговора]",			"Источник.Договор.ДатаДоговора");
	Результат.Вставить("[НомерОтчетаЭкспедитора]",	"CW_Документы.ПолучитьНомерНаПечать(Источник)");
	Результат.Вставить("[ДатаОтчетаЭкспедитора]",	"Источник.Дата");
	
	Результат.Вставить("[ФИООтправителя]", "CW_Печать.ФамилияИОИзСтрокиФамилияИмяОтчество(НастройкиПользователя.ФИО, Источник.Дата)");
	
	ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.ОписаниеМакросовПараметровГрузоперевозок(Результат);
	
КонецПроцедуры  

Функция ПолучитьСписокГрузоперевозок(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	|ИЗ
	|	Документ.CW_ОтчетЭкспедитора.Услуги КАК ТабличнаяЧастьУслуги
	|ГДЕ
	|	ТабличнаяЧастьУслуги.Ссылка = &Источник";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции  

Функция ПолучитьСписокЗаказов(Источник) Экспорт
	
	Массив = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ТабличнаяЧастьУслуги.Грузоперевозка.Заказ КАК Заказ
	|ИЗ
	|	Документ.CW_ОтчетЭкспедитора.Услуги КАК ТабличнаяЧастьУслуги
	|ГДЕ
	|	ТабличнаяЧастьУслуги.Ссылка = &Источник";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		Массив.Добавить(Выборка.Заказ);
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");
	
КонецФункции

Функция ПолучитьЗначениеПараметра(Источник, ИдентификаторПараметра,  ПолучаемоеЗначение = "Значение", СоответствиеПараметров) Экспорт

	ПараметрСсылка = СоответствиеПараметров.Получить(ИдентификаторПараметра);
	Если ПараметрСсылка = Неопределено Тогда
		Возврат "";
	КонецЕсли;
	
	МассивГрузоперевозок = Новый Массив;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧастьУслуги.Грузоперевозка КАК Грузоперевозка
	               |ИЗ
	               |	Документ.CW_ОтчетЭкспедитора.Услуги КАК ТабличнаяЧастьУслуги
	               |ГДЕ
	               |	ТабличнаяЧастьУслуги.Ссылка = &Источник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ТабличнаяЧастьУслуги.Грузоперевозка";
	
	Запрос.УстановитьПараметр("Источник", Источник); 
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		МассивГрузоперевозок.Добавить(Выборка.Грузоперевозка);
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_Грузоперевозки.Ссылка КАК Ссылка,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.Значение, ЕСТЬNULL(ПараметрыЗаказов.Значение, НЕОПРЕДЕЛЕНО)) КАК Значение,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеПлан, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеПлан, НЕОПРЕДЕЛЕНО)) КАК ЗначениеПлан,
	               |	ЕСТЬNULL(ПараметрыГрузоперевозок.ЗначениеФакт, ЕСТЬNULL(ПараметрыЗаказов.ЗначениеФакт, НЕОПРЕДЕЛЕНО)) КАК ЗначениеФакт
	               |ИЗ
	               |	Справочник.CW_Грузоперевозки КАК CW_Грузоперевозки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиГрузоперевозок КАК ПараметрыГрузоперевозок
	               |		ПО CW_Грузоперевозки.Ссылка = ПараметрыГрузоперевозок.Грузоперевозка
	               |			И (ПараметрыГрузоперевозок.Параметр = &Параметр)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.CW_ХарактеристикиЗаказов КАК ПараметрыЗаказов
	               |		ПО CW_Грузоперевозки.Заказ = ПараметрыЗаказов.Заказ
	               |			И (ПараметрыЗаказов.Параметр = &Параметр)
	               |ГДЕ
	               |	CW_Грузоперевозки.Ссылка В(&МассивГрузоперевозок)";
	
	Запрос.УстановитьПараметр("МассивГрузоперевозок", 	МассивГрузоперевозок);
	Запрос.УстановитьПараметр("Параметр", 				ПараметрСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Массив = новый Массив;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ЗначениеПараметра = Выборка[ПолучаемоеЗначение];
		Если Не ЗначениеЗаполнено(ЗначениеПараметра) Тогда
			Продолжить;
		КонецЕсли;
		
		Если Массив.Найти(ЗначениеПараметра) = Неопределено Тогда
			Массив.Добавить(ЗначениеПараметра);
		конецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(Массив, ", ");

КонецФункции
//---Шаблоны стандартных писем


#КонецЕсли
